# Brewfile for lemonzi's dotfiles (OSX version only)
# For now, they are sorted by order

brew 'ack'
brew 'bash'
brew 'bfg'
brew 'coreutils'
brew 'ctags'
brew 'exiftool'
brew 'openssl'
brew 'python'
brew 'git'
brew 'ffmpeg'
brew 'gcc', args: ['without-multilib']
brew 'heroku-toolbelt'
brew 'hr'
brew 'hub'
brew 'icdiff'
brew 'imagemagick'
brew 'libsndfile'
brew 'node'
brew 'sox'
brew 'spark'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'vim'
brew 'z'
brew 'peco'
brew 'jq'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/dupes/gdb'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'homebrew/dupes/rsync'
brew 'homebrew/science/perf'
brew 'homebrew/x11/ddd'

# Apps

cask 'audacity'
cask 'basictex'
cask 'bibdesk'
cask 'caffeine'
cask 'cheatsheet'
cask 'divvy'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-nik-collection'
cask 'insync'
cask 'joinme'
cask 'mendeley-desktop'
cask 'musescore'
cask 'namechanger'
cask 'pandoc'
cask 'pd'
cask 'sequel-pro'
cask 'skype'
cask 'sonic-visualiser'
cask 'soundflower'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
cask 'argon/mas/mas'

# Quicklook plugins

cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Useful but not installed by default

# cask 'kivy' (python app sdk, never used it)
# brew 'fpp'
# cask 'osxfuse'
# brew 'homebrew/fuse/simple-mtpfs'
# brew 'homebrew/fuse/sshfs'
