# Brewfile for lemonzi's dotfiles (OSX version only)
# For now, they are sorted by order

brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'blueutil'
brew 'cmake'
brew 'coreutils'
brew 'exiftool'
brew 'ffmpeg'
brew 'gcc', args: ['without-multilib']
brew 'gdb'
brew 'git'
brew 'hr'
brew 'hub'
brew 'icdiff'
brew 'imagemagick'
brew 'libsndfile'
brew 'node'
brew 'pandoc'
brew 'python'
brew 'sox'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim', args: ['with-lua']

tap 'universal-ctags/universal-ctags'
brew 'universal-ctags', args: ['HEAD']

tap 'homebrew/dupes'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'homebrew/dupes/rsync'

tap 'homebrew/science'
brew 'homebrew/science/perf'

# Apps

tap 'caskroom/cask'

cask 'audacity'
cask 'basictex'
cask 'bibdesk'
cask 'caffeine'
cask 'divvy'
cask 'dropbox'
cask 'google-chrome'
cask 'google-nik-collection'
cask 'insync'
cask 'pd'
cask 'skype'
cask 'sonic-visualiser'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'

# Quicklook plugins

cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# Useful but not installed by default

# brew 'bfg'  # Git repo cleaner
# brew 'fpp'
# brew 'heroku-toolbelt'
# brew 'peco'
# brew 'openssl'
# brew 'jq'
# brew 'spark'  # Command-line bar graphs
# brew 'thefuck'
# brew 'z'
# tap 'homebrew/x11'
# brew 'homebrew/x11/ddd'
# tap 'homebrew/fuse'
# brew 'homebrew/fuse/simple-mtpfs'
# brew 'homebrew/fuse/sshfs'
# cask 'soundflower'
# cask 'osxfuse'
# cask 'kivy' (python app sdk, never used it)
# cask 'cheatsheet'
# cask 'firefox'
# cask 'joinme'
# cask 'mendeley-desktop'
# cask 'musescore'
# cask 'namechanger'
# cask 'sequel-pro'

# Mac App Store
# tap 'argon/mas'
# brew 'argon/mas/mas'
# mas 'Keynote'

